Autodesk.Revit.DB.Structure.StructuralWallUsage
Since:
2011
Represents the structural usage of a wall.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralWallUsage.Combined
Structural usage is combined.

Autodesk.Revit.DB.Structure.StructuralWallUsage.Shear
Structural usage is shear.

Autodesk.Revit.DB.Structure.StructuralWallUsage.Bearing
Structural usage is bearing.

Autodesk.Revit.DB.Structure.StructuralWallUsage.NonBearing
Structural usage is non-bearing.